Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveNonStoryLevel
The level set as the Story Above for these levels is no longer a story level. This change will cause these levels to revert to the default Story Above.

Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveMoved
The level set as the Story Above for these levels has moved below these levels. This change will cause these levels to revert to the default Story Above.

Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveDeleted
The level set as the Story Above for these levels is being deleted. This change will cause these levels to revert to the default Story Above.

Autodesk.Revit.DB.BuiltInFailures.LevelFailures.NoLevelsLeftReloading
As a result of Reloading Latest, there are no Levels left. Create a new Level, and then Reload Latest again.

Autodesk.Revit.DB.BuiltInFailures.LevelFailures.NoLevelsLeft
There are no levels or plan views remaining in the project.

Autodesk.Revit.DB.BuiltInFailures.LevelFailures
Failures about Level.